[
  {
    "date": "2025-11-28",
    "source_file": "Tech News Aggregation and Analysis Request (10).pdf",
    "page": 2,
    "title": "MIT's \"Iceberg Index\" Says 12% of Jobs Are Already Gone",
    "summary": "A massive simulation by MIT and Oak Ridge National Lab created a digital twin of the US economy, revealing that 11.7% of the workforce is technically displaceable by current AI right now. The study specifically highlights 'invisible' back-office roles in finance and healthcare as the most vulnerable.",
    "engagement": "High",
    "raw_text": "Okay, this is actually terrifying. MIT and Oak Ridge National Lab just dropped something called the 'Iceberg Index,' and it is not your typical doom-scrolling headline. They literally used a supercomputer to build a 'digital twin' of the entire US economy—simulating 151 million workers—and ran the numbers on current AI capabilities. The result? 12% of the workforce is *already* technically obsolete. We’re talking about a $1.2 trillion wage pool that AI can handle today. And here's the kicker: it’s not the creative jobs everyone is worried about. It’s the 'submerged' economy—medical coding, supply chain logistics, back-office admin. These are the safe jobs! If you work in finance or healthcare ops, you need to see this data. This isn't a prediction for 2030; they're saying the tech is here right now.",
    "id": "JOB-12-MIT-ORNL",
    "category": "Society",
    "companies": [
      "MIT",
      "Oak Ridge National Laboratory"
    ],
    "people": [],
    "created_at": "2025-11-28T11:04:20.000Z"
  },
  {
    "date": "2025-11-28",
    "source_file": "Tech & AI Daily Briefing – 28 November 2025.pdf",
    "page": 1,
    "title": "OpenAI Data Breach: Mixpanel Leak Exposes Users",
    "summary": "OpenAI has disclosed a data breach involving third-party analytics provider Mixpanel, exposing metadata like API account names and email addresses. While no chat contents or passwords were stolen, security experts warn of targeted phishing attacks against API customers.",
    "engagement": "High",
    "raw_text": "So, OpenAI just had a security slip-up, but it wasn't ChatGPT going rogue. It turns out their analytics provider, Mixpanel, got breached. If you're an API user, listen up: attackers got away with account names, emails, and location data. OpenAI says your actual prompts and passwords are safe, but here’s the problem—this is gold for phishing. Hackers now know exactly who is building what on OpenAI's platform. It’s a huge reminder that even if the AI is secure, the supply chain around it might not be. If you've got an OpenAI API account, keep your eyes peeled for some very convincing scam emails coming your way.",
    "id": "OAI-MIX-BREACH",
    "category": "Security",
    "companies": [
      "OpenAI",
      "Mixpanel"
    ],
    "people": [],
    "created_at": "2025-11-28T11:04:20.000Z"
  },
  {
    "date": "2025-11-28",
    "source_file": "Combined",
    "page": 4,
    "title": "Alibaba's Quark Glasses: The $270 Meta Ray-Ban Killer?",
    "summary": "Alibaba has launched the Quark AI smart glasses in China for roughly $270, featuring deep integration with payment and shopping ecosystems. The device runs on the Qwen model and offers real-time object recognition, translation, and teleprompter features.",
    "engagement": "High",
    "raw_text": "Move over Meta Ray-Bans, Alibaba just entered the chat. They just dropped the 'Quark' AI smart glasses, and they are priced aggressively at around $270. Unlike Meta's glasses which are all about social media, these things are built for utility. They run on Alibaba’s Qwen model and hook directly into Alipay and Taobao. Imagine walking down the street, looking at a product, and instantly seeing the price or buying it with a voice command. They’ve got 24-hour battery life and look like normal frames. This is the 'everyday AI' hardware we've been waiting for. It's China-only for now, but this signals a massive shift in how we're going to shop.",
    "id": "ALI-QUARK-GLS",
    "category": "Hardware",
    "companies": [
      "Alibaba"
    ],
    "people": [],
    "created_at": "2025-11-28T11:04:20.000Z"
  },
  {
    "date": "2025-11-28",
    "source_file": "Tech News Aggregation and Analysis Request (10).pdf",
    "page": 7,
    "title": "Google CEO: Quantum Computers Are Ready in 5 Years",
    "summary": "In a BBC interview, Alphabet CEO Sundar Pichai stated that quantum computing is now where AI was in 2020, predicting a major commercial breakthrough within five years. This timeline suggests Google is moving from experimental physics to engineering scaling.",
    "engagement": "High",
    "raw_text": "Sundar Pichai just put a date on the Quantum revolution. In a rare interview, the Google CEO said Quantum computing right now is where AI was in 2020—just before the GPT explosion. He is predicting a commercial breakthrough in five years. Think about that. We are hitting the physical limits of silicon chips, and Google is basically saying, 'Don't worry, the post-silicon era is loading.' If he's right, we're looking at solving problems in seconds that would take current supercomputers millions of years. The clock is officially ticking on the Quantum era.",
    "id": "GOOG-QUANTUM-5Y",
    "category": "Quantum Computing",
    "companies": [
      "Google",
      "Alphabet"
    ],
    "people": [
      "Sundar Pichai"
    ],
    "created_at": "2025-11-28T11:04:20.000Z"
  },
  {
    "date": "2025-11-28",
    "source_file": "Tech & AI Daily Briefing – 28 November 2025.pdf",
    "page": 3,
    "title": "Microsoft's Fara-7B: AI That Controls Your PC",
    "summary": "Microsoft has released Fara-7B, a lightweight 7-billion parameter model designed to autonomously control mouse and keyboard actions on a local PC. Benchmarks show it matching cloud-based models at a fraction of the cost, emphasizing privacy and local processing.",
    "engagement": "High",
    "raw_text": "Microsoft just changed the game for local AI. They released Fara-7B, and this isn't just another chatbot. This thing is a 'Computer Use Agent'—it can literally see your screen, click your mouse, and type for you. And the best part? It's a 7B model, meaning it runs locally on your laptop. No sending screenshots to the cloud, no privacy nightmares. They're calling it 'pixel sovereignty.' It costs pennies to run compared to GPT-4 based agents. We are rapidly moving away from chatting with AI to just letting AI do the work for us on our own machines.",
    "id": "MSFT-FARA-7B",
    "category": "AI",
    "companies": [
      "Microsoft"
    ],
    "people": [],
    "created_at": "2025-11-28T11:04:20.000Z"
  },
  {
    "date": "2025-11-28",
    "source_file": "Tech News Aggregation and Analysis Request (10).pdf",
    "page": 10,
    "title": "$700 Robot Dogs Are Here: The Commoditization of Autonomy",
    "summary": "Chinese logistics firm MingZhu has secured a deal to supply 10,000 MZ-01 Robot Dogs to the US for approx $700 per unit. This price point disrupts the market previously dominated by the $75,000 Boston Dynamics Spot, enabling mass deployment for home security and delivery.",
    "engagement": "High",
    "raw_text": "You want a robot dog? You might actually be able to afford one now. A Chinese firm just signed a deal to ship 10,000 robot dogs to the US, and the unit price is roughly $700. Seven. Hundred. Dollars. For context, a Boston Dynamics Spot robot costs seventy-five grand. We are witnessing the absolute commoditization of robotics in real-time. At this price, you're going to see these things everywhere—patrolling warehouses, delivering packages, maybe even guarding driveways. The 'Sci-Fi future' is suddenly looking very cheap and very accessible.",
    "id": "ROBOT-DOG-700",
    "category": "Robotics",
    "companies": [
      "MingZhu Logistics",
      "Tick Toc Apex"
    ],
    "people": [],
    "created_at": "2025-11-28T11:04:20.000Z"
  },
  {
    "date": "2025-11-28",
    "source_file": "Tech & AI Daily Briefing – 28 November 2025.pdf",
    "page": 1,
    "title": "DeepSeek Math-V2 Crushes Olympiad Benchmarks",
    "summary": "Chinese startup DeepSeek released Math-V2, an open-weight model that achieved gold-medal level scores on Olympiad math problems. It uses a unique 'self-verifying' training method, allowing it to check its own proofs for rigor before finalizing an answer.",
    "engagement": "Medium",
    "raw_text": "The open-source AI race just got a new leader in math. DeepSeek out of China just dropped Math-V2, and it is putting up numbers that are honestly scary. It scored Gold Medal level on International Math Olympiad problems. How? It doesn't just guess the answer. It uses a 'self-verification' process where it acts as its own judge to score the rigor of its proofs step-by-step. This is huge because it solves the biggest issue with LLMs—hallucination in logic. If you're a dev or a researcher, you need to pull this model. It's open weights, and it's beating proprietary systems.",
    "id": "DEEPSEEK-MATH-V2",
    "category": "AI Research",
    "companies": [
      "DeepSeek"
    ],
    "people": [],
    "created_at": "2025-11-28T11:04:20.000Z"
  },
  {
    "date": "2025-11-28",
    "source_file": "AI Research & Breakthroughs (4).pdf",
    "page": 3,
    "title": "Deloitte Caught Faking Gov Reports with AI",
    "summary": "Consultancy giant Deloitte is under scrutiny after using generative AI to draft government reports that contained fabricated references and quotes. The firm has been forced to issue refunds and review millions of dollars in contracts in Canada and Australia.",
    "engagement": "High",
    "raw_text": "This is embarrassing. Deloitte, one of the 'Big Four' consulting firms, just got caught using AI to fake government reports. I'm talking about fully hallucinated quotes and references in reports they charged millions for. Clients in Canada and Australia started checking the footnotes and realized the sources didn't exist. They are now refunding contracts and scrambling to explain themselves. It is the ultimate 'lazy student' move, but on a corporate scale. If you're using ChatGPT for work, let this be your warning: Check. Your. Sources.",
    "id": "DELOITTE-AI-FAIL",
    "category": "Business",
    "companies": [
      "Deloitte"
    ],
    "people": [],
    "created_at": "2025-11-28T11:04:20.000Z"
  },
  {
    "date": "2025-11-28",
    "source_file": "Tech News Aggregation and Analysis Request (10).pdf",
    "page": 9,
    "title": "EU Declares War on Apple Maps & Ads",
    "summary": "The European Commission has notified Apple that its Maps and Ads services likely qualify as 'gatekeepers' under the Digital Markets Act. This designation would force Apple to open these ecosystems to third-party rivals, potentially breaking its privacy-focused business model.",
    "engagement": "High",
    "raw_text": "Apple is in big trouble in Europe... again. The EU just told Apple that Maps and Apple Ads are likely 'gatekeepers.' If this sticks, Apple has to open them up. Imagine third-party ad trackers inside iOS or having to let other map services integrate as defaults deeper than they do now. Apple is furious, arguing they are tiny compared to Google Maps, but the EU isn't buying it. This is a direct attack on Apple's 'walled garden.' If the EU wins this, the iPhone experience is going to look very different in a few years.",
    "id": "EU-APPLE-DMA",
    "category": "Policy",
    "companies": [
      "Apple",
      "European Commission"
    ],
    "people": [],
    "created_at": "2025-11-28T11:04:20.000Z"
  },
  {
    "date": "2025-11-28",
    "source_file": "Tech & AI Daily Briefing – 28 November 2025.pdf",
    "page": 3,
    "title": "Google Launches 'Antigravity' Agentic IDE",
    "summary": "Google has released Antigravity, a new AI-first development environment where autonomous agents plan, code, and test software. However, security researchers have already found vulnerabilities where malicious code can embed backdoors via the workspace trust model.",
    "engagement": "Medium",
    "raw_text": "Google just dropped a new IDE called 'Antigravity,' and it's wild. It's not just a code editor; it's an 'agent-first' platform where you tell AI agents to build features, and they plan, code, and test them autonomously. It sounds amazing, but there's a catch. Security researchers *immediately* found a way to backdoor it. Because the agents have so much freedom, malicious code can trick them into leaking your local files just by opening a project. It’s the classic 'convenience vs. security' battle, but for coding. Developers, proceed with caution.",
    "id": "GOOG-ANTIGRAV",
    "category": "Dev Tools",
    "companies": [
      "Google",
      "Mindgard"
    ],
    "people": [],
    "created_at": "2025-11-28T11:04:20.000Z"
  },
  {
    "date": "2025-11-28",
    "source_file": "AI Research & Breakthroughs (4).pdf",
    "page": 2,
    "title": "Amazon Drops $50B on Gov Cloud AI",
    "summary": "Amazon Web Services has committed up to $50 billion to build massive AI infrastructure for the US government over the next decade. The investment targets 'Top Secret' and defense workloads, aiming to secure US leadership in AI supercomputing.",
    "engagement": "Medium",
    "raw_text": "Amazon is doubling down on Uncle Sam. AWS just announced a massive $50 billion investment to build AI supercomputers for the US government. We’re talking about classified, 'Top Secret' level data centers aimed at keeping the US ahead in the AI arms race. This isn't just about hosting websites; this is about giving the military and intel agencies access to the most powerful AI training clusters on the planet. Big Tech and Big Gov are getting tighter than ever.",
    "id": "AWS-GOV-50B",
    "category": "Business",
    "companies": [
      "Amazon",
      "AWS"
    ],
    "people": [],
    "created_at": "2025-11-28T11:04:20.000Z"
  },
  {
    "date": "2025-11-28",
    "source_file": "Tech & AI Daily Briefing – 28 November 2025.pdf",
    "page": 5,
    "title": "Lloyds Bank Launching Agentic AI for 21M Users",
    "summary": "Lloyds Banking Group announced the UK's first large-scale agentic AI financial assistant, rolling out to 21 million customers by 2026. Unlike simple chatbots, this agent can autonomously analyze spending and model savings scenarios.",
    "engagement": "Medium",
    "raw_text": "Banking is about to get a lot smarter—or creepier, depending on how you look at it. Lloyds Bank in the UK is rolling out an 'Agentic AI' to 21 million customers. This isn't a dumb chatbot that tells you your balance. It’s an agent that can actively model your savings, analyze your spending habits, and give you financial coaching 24/7. It’s a bold move to put autonomous AI directly into a banking app. If this works, the days of waiting on hold for a bank teller are officially numbered.",
    "id": "LLOYDS-AI-AGENT",
    "category": "Fintech",
    "companies": [
      "Lloyds Banking Group"
    ],
    "people": [],
    "created_at": "2025-11-28T11:04:20.000Z"
  }
]