[
  {
    "id": "GEO-VEN-001",
    "date": "2026-01-06",
    "category": "Geopolitics",
    "sub_category": "Latin America Crisis",
    "source_file": "Global News Aggregation and Analysis Report.pdf",
    "title": "US Spec Ops KIDNAP Maduro? (War Started?)",
    "title_professional": "US Forces Extract Venezuelan President Maduro; Global Tensions Rise",
    "virality_score": 10,
    "summary_short": "US special forces executed a precision extraction of Nicolas Maduro in Caracas, charging him with narco-terrorism in NYC. The move has created a power vacuum and signaled a return to aggressive resource-driven US foreign policy.",
    "script_hook": "Wait, did the US actually just kidnap a sitting president? You need to see this.",
    "script_body": "Okay, stop scrolling because history just changed overnight. In a move that looks straight out of a Tom Clancy novel, US special forces breached security in Caracas and literally extracted President Nicolás Maduro. Yes, he is currently sitting in a jail cell in New York City facing narco-terrorism charges. The White House is calling it a 'surgical law enforcement operation,' but let's be real—this is a massive geopolitical earthquake. China and Russia are furious, calling it a violation of sovereignty, while the US is openly talking about 'temporarily running' Venezuela to stabilize oil markets. We are talking about the world's largest oil reserves suddenly changing hands. Is this the return of 19th-century imperialism? The markets are rallying, but diplomatic ties are snapping everywhere. This is the biggest power play we've seen in decades.",
    "script_cta": "Subscribe and comment 'WAR' if you think this escalates into WW3.",
    "visual_prompt_thumbnail": "Cinematic split screen: On the left, US special forces night raid in Caracas with green night vision; on the right, Nicolas Maduro in an orange jumpsuit in a US court. High contrast, bold red text 'EXTRACTED'. 8k resolution.",
    "visual_prompt_broll": "Map of Venezuela turning from red to American flag colors; oil barrels rolling over a map of South America; footage of US naval ships moving in the Caribbean.",
    "entities": {
      "companies": ["Chevron", "Valero Energy"],
      "people": ["Nicolás Maduro", "Donald Trump", "Cilia Flores"],
      "locations": ["Caracas", "New York City", "Venezuela"]
    },
    "hashtags": [
      "#Venezuela",
      "#Maduro",
      "#USMilitary",
      "#Geopolitics",
      "#BreakingNews",
      "#OilCrisis"
    ],
    "tone": "Urgent",
    "created_at": "2026-01-06T15:36:30.000Z"
  },
  {
    "id": "GEO-GRN-002",
    "date": "2026-01-06",
    "category": "Geopolitics",
    "sub_category": "NATO Crisis",
    "source_file": "Global News Aggregation and Analysis Report.pdf",
    "title": "Trump Buys Greenland OR ELSE? (NATO Over?)",
    "title_professional": "US Issues Ultimatum for Greenland Purchase; Denmark Warns of NATO Collapse",
    "virality_score": 9,
    "summary_short": "President Trump has issued a 20-day timeline to buy Greenland, threatening the stability of NATO. Denmark and Greenland have rejected the offer, with European leaders rallying behind Danish sovereignty.",
    "script_hook": "The US just gave an ultimatum to buy an entire country. I'm not joking.",
    "script_body": "If you thought the Venezuela thing was wild, look at the Arctic. The US President has officially revived the plan to buy Greenland, but this time it's not a request—it's a threat. He gave Denmark a 20-day timeline, saying 'We need Greenland.' Why? It's all about the GIUK gap—stopping Russia and China in the Arctic. But here is the scary part: Denmark's Prime Minister just said if the US tries to take it by force, NATO is done. Finished. We are looking at the potential end of the Western military alliance because the US wants to buy the world's largest island. European leaders are panicking, and the map of Greenland was literally posted by US officials draped in an American flag with the caption 'SOON.' This is aggressive, it's unprecedented, and it could break Europe apart.",
    "script_cta": "Hit like if you think countries shouldn't be for sale!",
    "visual_prompt_thumbnail": "A map of Greenland being cracked open by a giant golden hammer. US flag on one side, Danish flag on the other. Dramatic lightning background. Text: 'FOR SALE?'",
    "visual_prompt_broll": "Animated map showing the 'GIUK Gap' with warships; icy landscapes of Greenland; split screen of Trump and Mette Frederiksen looking angry.",
    "entities": {
      "companies": [],
      "people": ["Donald Trump", "Mette Frederiksen", "Jens-Frederik Nielsen"],
      "locations": ["Greenland", "Denmark", "Arctic"]
    },
    "hashtags": [
      "#Greenland",
      "#NATO",
      "#Trump",
      "#WW3",
      "#Geopolitics",
      "#Europe"
    ],
    "tone": "Alarmed",
    "created_at": "2026-01-06T15:36:30.000Z"
  },
  {
    "id": "TECH-NVDA-003",
    "date": "2026-01-06",
    "category": "AI",
    "sub_category": "Hardware",
    "source_file": "Global News Aggregation and Analysis Report.pdf",
    "title": "Nvidia Just Killed ChatGPT (Physical AI is Here)",
    "title_professional": "Nvidia Unveils Vera Rubin Platform; Shifts Focus to Physical AI",
    "virality_score": 8,
    "summary_short": "At CES 2026, Nvidia revealed the 'Vera Rubin' AI platform, a 6-chip system designed for robotics and 'physical AI.' It promises 10x lower inference costs and is already in full production.",
    "script_hook": "Forget chatbots. Nvidia just announced the brain for actual robots.",
    "script_body": "We are at CES 2026 and Jensen Huang just dropped the mic. Meet the 'Vera Rubin' platform. This isn't just a faster chip; it's a six-chip beast designed to move us from Generative AI—like typing to ChatGPT—to *Physical AI*. We are talking about the computing power needed for humanoid robots to walk, work, and reason in the real world. It has 10x lower costs and 5x power efficiency compared to the old Blackwell chips. But the kicker? It creates a 'Trusted Execution Environment,' meaning it's secure enough for military and government secrets. Nvidia says this is in full production right now. The age of software AI is over; the age of Robot AI has just begun. If you hold stock, you're probably smiling today.",
    "script_cta": "Are you ready for robot workers? Let me know in the comments.",
    "visual_prompt_thumbnail": "Jensen Huang holding a glowing futuristic chip on stage at CES. Behind him, a silhouette of a humanoid robot with glowing eyes. Text: 'THE RUBIN ERA'. Cyberpunk aesthetic.",
    "visual_prompt_broll": "Footage of Boston Dynamics robots dancing overlaid with Nvidia chip schematics; server racks glowing green; Jensen Huang keynote highlights.",
    "entities": {
      "companies": ["Nvidia", "Arm"],
      "people": ["Jensen Huang"],
      "locations": ["Las Vegas", "CES 2026"]
    },
    "hashtags": [
      "#Nvidia",
      "#AI",
      "#CES2026",
      "#Robotics",
      "#TechNews",
      "#VeraRubin"
    ],
    "tone": "Excited",
    "created_at": "2026-01-06T15:36:30.000Z"
  },
  {
    "id": "HLTH-VAC-004",
    "date": "2026-01-06",
    "category": "Health",
    "sub_category": "Policy",
    "source_file": "Global News Aggregation and Analysis Report.pdf",
    "title": "CDC BANS Vaccines? (New Trump Policy)",
    "title_professional": "Trump Administration Slashes Recommended Pediatric Vaccine Schedule",
    "virality_score": 9,
    "summary_short": "The US administration has overhauled public health guidance, reducing the childhood vaccine schedule from 17 to 11 shots. The move, influenced by RFK Jr.-aligned advisors, removes universal recommendations for Flu and Hepatitis A.",
    "script_hook": "The US government just cut the childhood vaccine schedule in half. Parents, listen up.",
    "script_body": "This is going to be the most controversial story of the year. The Trump administration, backed by advisors aligned with RFK Jr., has radically slashed the CDC's recommended vaccine list. We went from 17 recommended shots down to 11. Hep B at birth? Gone. Universal Flu shots? Gone. Rotavirus? Gone. They are calling it the 'Denmark Model,' arguing the US gives too many shots. But doctors are freaking out. We are in the middle of a massive flu surge, and the government just told everyone 'it's up to you.' The American Academy of Pediatrics calls it 'political,' not medical. This shifts all the decision-making to parents and could cause insurance companies to drop coverage for these shots. Whatever side you're on, the standard of care in America just changed overnight.",
    "script_cta": "Is this freedom or dangerous? Debate in the comments, keep it civil!",
    "visual_prompt_thumbnail": "Close up of a syringe being broken in half by a hand in a suit. Background is a blurred hospital hallway. Text overlay: 'CDC SLASHES LIST'.",
    "visual_prompt_broll": "Footage of a pediatrician shaking their head; graphics showing the list of 17 vaccines crossing out 6 items; Robert F. Kennedy Jr. clip.",
    "entities": {
      "companies": ["CDC", "American Academy of Pediatrics"],
      "people": ["Robert F. Kennedy Jr.", "Donald Trump"],
      "locations": ["USA"]
    },
    "hashtags": [
      "#Vaccines",
      "#RFKJr",
      "#HealthNews",
      "#CDC",
      "#Trump2026",
      "#Parenting"
    ],
    "tone": "Serious",
    "created_at": "2026-01-06T15:36:30.000Z"
  },
  {
    "id": "ENT-RIP-005",
    "date": "2026-01-06",
    "category": "Entertainment",
    "sub_category": "Crime",
    "source_file": "Global News Aggregation and Analysis Report.pdf",
    "title": "Rob Reiner MURDERED? (Hollywood in Shock)",
    "title_professional": "Director Rob Reiner and Wife Found Dead; Son Arrested",
    "virality_score": 10,
    "summary_short": "Legendary director Rob Reiner and his wife Michele were found stabbed to death in their LA home. Their son, Nick Reiner, has been arrested and is held on $4 million bail.",
    "script_hook": "This is absolutely tragic. A Hollywood legend has been found murdered in his own home.",
    "script_body": "It is a dark day in Hollywood. Rob Reiner, the genius behind 'The Princess Bride' and 'When Harry Met Sally,' was found dead alongside his wife Michele in their Los Angeles home. They were stabbed to death. And the details get even worse—police have arrested their own son, Nick Reiner. He's currently being held on $4 million bail. This isn't just a celebrity death; it's a familial tragedy of Shakespearean proportions. The entire industry is in shock. Reiner defined comedy and heart for a generation, and to go out like this... it's just heartbreaking. 2026 is starting off with some incredibly heavy news.",
    "script_cta": "Drop an 'RIP' for a legend who gave us so many classics.",
    "visual_prompt_thumbnail": "Black and white photo of Rob Reiner looking happy, with a torn paper effect showing police tape and a mugshot of his son in the background. Text: 'TRAGEDY'.",
    "visual_prompt_broll": "Clips from 'The Princess Bride' and 'Stand By Me'; aerial shot of the LA home with police cars; photo of Rob and his son Nick from happier times.",
    "entities": {
      "companies": [],
      "people": ["Rob Reiner", "Michele Reiner", "Nick Reiner"],
      "locations": ["Los Angeles"]
    },
    "hashtags": [
      "#RobReiner",
      "#Hollywood",
      "#BreakingNews",
      "#TrueCrime",
      "#RIP",
      "#Movies"
    ],
    "tone": "Somber",
    "created_at": "2026-01-06T15:36:30.000Z"
  },
  {
    "id": "CRYPTO-XRP-006",
    "date": "2026-01-06",
    "category": "Economy",
    "sub_category": "Crypto",
    "source_file": "Global News Aggregation and Analysis Report.pdf",
    "title": "XRP Explodes +11%! Dogecoin to $10?",
    "title_professional": "Crypto Markets Surge; XRP Up 11.5% on SEC Rumors",
    "virality_score": 7,
    "summary_short": "Cryptocurrencies are outperforming traditional assets, with XRP jumping 11.5% on rumors of an SEC settlement. Bitcoin is eyeing $100k, and Dogecoin speculation is rampant.",
    "script_hook": "If you hold XRP, you just made a lot of money.",
    "script_body": "The crypto markets are absolutely loving the chaos right now. While the world is worrying about war, crypto is printing green candles. XRP is the star of the show today, surging over 11.5% to hit $2.39. Why? Rumors are flying that with the new administration, the SEC lawsuit is finally getting settled favorably. Bitcoin is back near $94k and traders are betting we smash $100k again very soon. And of course, the meme coin mania is back—Dogecoin is seeing wild speculation of a massive surge. It looks like investors are treating crypto as a safe haven while governments fight over oil and ice. Are we entering the biggest bull run yet?",
    "script_cta": "What are you buying? XRP, BTC, or memes? Tell me below.",
    "visual_prompt_thumbnail": "A golden XRP coin rocket launching into space, leaving a trail of green chart lines. Background is the moon. Text: 'XRP MOONING'.",
    "visual_prompt_broll": "Live crypto charts showing green candles; Elon Musk tweeting (mockup); split screen of Bitcoin and XRP logos.",
    "entities": {
      "companies": ["Ripple", "SEC"],
      "people": [],
      "locations": []
    },
    "hashtags": [
      "#XRP",
      "#Crypto",
      "#Bitcoin",
      "#Dogecoin",
      "#ToTheMoon",
      "#Investing"
    ],
    "tone": "Enthusiastic",
    "created_at": "2026-01-06T15:36:30.000Z"
  },
  {
    "id": "SCI-MIG-007",
    "date": "2026-01-06",
    "category": "Science",
    "sub_category": "Biology",
    "source_file": "Global News Aggregation and Analysis Report.pdf",
    "title": "Viruses Have Vehicles? (Scary Discovery)",
    "title_professional": "Scientists Discover 'Migrions': Viruses That Use Cells as Vehicles",
    "virality_score": 6,
    "summary_short": "Researchers have identified 'migrions,' a mechanism where viruses hijack moving cells to transport themselves, overturning previous models of infection spread.",
    "script_hook": "Scientists just found out viruses are smarter than we thought.",
    "script_body": "You know how we thought viruses just float around and infect cells one by one? Wrong. Researchers have discovered something called 'migrions.' Basically, the virus hijacks a cell and turns it into a literal vehicle—a taxi—to drive itself to new parts of the body. This is a game-changer for understanding how infections spread and even how cancer metastasis works. It's like finding out the enemy has been using armored personnel carriers while we were looking for foot soldiers. This could lead to totally new treatments, but honestly? It's kind of terrifying how complex biology actually is.",
    "script_cta": "Science is wild. Subscribe for more daily discoveries.",
    "visual_prompt_thumbnail": "Microscopic view of a virus cell with little wheels or an engine attached, driving through a vein. 3D render, high detail. Text: 'IT CAN DRIVE?'",
    "visual_prompt_broll": "Animation of a cell moving through a bloodstream carrying viral particles; lab footage of scientists looking into microscopes.",
    "entities": {
      "companies": [],
      "people": [],
      "locations": []
    },
    "hashtags": [
      "#Science",
      "#Biology",
      "#Virus",
      "#MedicalBreakthrough",
      "#Migrions",
      "#Health"
    ],
    "tone": "Educational",
    "created_at": "2026-01-06T15:36:30.000Z"
  }
]
