[
  {
    "date": "2025-12-28",
    "source_file": "Combined",
    "page": 1,
    "title": "Disney Invests $1 Billion in OpenAI: Star Wars Coming to Sora?",
    "summary": "Disney has confirmed a $1 billion equity investment in OpenAI, granting the AI firm access to over 200 iconic characters from Star Wars, Marvel, and Pixar for use in tools like Sora. This partnership signals a major shift from litigation to licensing in the creative industries.",
    "engagement": "High",
    "raw_text": "Okay, this is absolutely massive news for the entertainment world. Disney just dropped a cool one billion dollars into OpenAI. But it's not just about the money—it's about the access. We're talking about OpenAI's video generator, Sora, officially getting the keys to the Magic Kingdom. Imagine generating high-quality clips using actual Star Wars, Marvel, or Pixar assets without getting sued into oblivion. Disney CEO Bob Iger and Sam Altman were on stage together, basically confirming that the era of 'pay-to-play' for AI copyright is here. Instead of fighting the AI wave, Disney is surfing it. For creators, this could be a dream come true or a nightmare depending on how they gatekeep these tools, but one thing is for sure: AI-generated content just got a Hollywood upgrade.",
    "id": "1d8dad4a",
    "category": "AI",
    "companies": [
      "Disney",
      "OpenAI"
    ],
    "people": [
      "Bob Iger",
      "Sam Altman"
    ],
    "created_at": "2025-12-28T23:47:25+05:30"
  },
  {
    "date": "2025-12-28",
    "source_file": "Today’s Tech News (Dec 28, 2025).pdf",
    "page": 2,
    "title": "Tesla App Leak Reveals Native Smartphone Keys Coming Soon",
    "summary": "Code found in the Tesla app v4.52.0 references 'Harmony Wallet Key Cards' and system-level digital keys. This suggests Tesla is moving away from Bluetooth-only phone keys to support native wallet integration on Android and potentially Apple Car Key.",
    "engagement": "High",
    "raw_text": "If you own a Tesla, you know the pain of the 'phone key' failing just when you're in a hurry. Well, good news might be on the way. Digging into the code of the latest Tesla app update, developers found references to native wallet key cards. This is huge because it means Tesla is finally adopting standard protocols—specifically mentioning Huawei's HarmonyOS, but experts are 99% sure this points to Apple Car Key support too. Instead of relying on a background app and Bluetooth—which we all know can be flaky—your car key would live in your phone's secure wallet element. It works even if your phone battery is dead. Rivian and BMW have been doing this for a while, so it's about time Elon caught up. No more doing the 'airplane mode toggle' dance in the parking lot!",
    "id": "T5E6S7L8",
    "category": "Hardware",
    "companies": [
      "Tesla",
      "Apple",
      "Huawei"
    ],
    "people": [],
    "created_at": "2025-12-28T23:47:25+05:30"
  },
  {
    "date": "2025-12-28",
    "source_file": "Act as a top-tier tech news aggregator and researc (45).pdf",
    "page": 3,
    "title": "Gamers Beware: Nvidia Rumored to Slash RTX 5000 Production",
    "summary": "Supply chain reports suggest Nvidia plans to reduce consumer supply of the RTX 5000 series by 40% in 2026. Capacity is reportedly being reallocated to Blackwell data center chips to meet insatiable AI demand.",
    "engagement": "High",
    "raw_text": "Gamers, you might want to sit down for this one. If you were planning to build a PC in 2026, it's going to get rough. Rumors are flying from the supply chain that Nvidia is planning a massive 40% cut in RTX 5000 series production. Why? Because AI is eating the world. They are reportedly shifting that manufacturing capacity over to their Blackwell data center chips because that's where the real money is right now. We're looking at a potential repeat of the GPU shortage era—scalpers, price hikes, the whole nightmare. If you care about local gaming hardware, this is a red alert. It looks like Nvidia is prioritizing the AI gold rush over their gaming roots, and honestly, can you blame them financially? It still hurts though.",
    "id": "G9P0U1S2",
    "category": "Hardware",
    "companies": [
      "Nvidia"
    ],
    "people": [
      "Jensen Huang"
    ],
    "created_at": "2025-12-28T23:47:25+05:30"
  },
  {
    "date": "2025-12-28",
    "source_file": "Tech News Aggregation and Analysis Request (26).pdf",
    "page": 9,
    "title": "OpenAI Testing Ads in ChatGPT: The Subscription Era Ends",
    "summary": "OpenAI is actively testing sponsored responses and secondary display ads within ChatGPT. This move signals a pivot from a pure subscription model to an ad-supported revenue stream, raising concerns about commercial bias in AI answers.",
    "engagement": "High",
    "raw_text": "So, the ad-free utopia of ChatGPT is officially crumbling. Reports are confirming that OpenAI is testing 'sponsored responses.' Yes, ads. But it's trickier than a banner on a website. Imagine asking ChatGPT for a dinner recommendation and it subtly nudging you toward a restaurant that paid for the spot. That introduces a massive 'trust' problem. If the AI is being paid to give you an answer, is it giving you the *best* answer or the *profitable* one? They call it a 'Principal-Agent Problem.' Basically, your helpful AI assistant might actually be a double agent for advertisers. Sam Altman is trying to monetize the free tier aggressively, and this puts them directly in a cage match with Google. Get ready for 'This answer is brought to you by...' in your chats.",
    "id": "O3P4E5N6",
    "category": "Business",
    "companies": [
      "OpenAI",
      "Google"
    ],
    "people": [
      "Sam Altman"
    ],
    "created_at": "2025-12-28T23:47:25+05:30"
  },
  {
    "date": "2025-12-28",
    "source_file": "Tech News Aggregation and Analysis Request (26).pdf",
    "page": 2,
    "title": "INTELLECT-3: The Open Source Model That Breaks the 100B Barrier",
    "summary": "Prime Intellect has released INTELLECT-3, a 106-billion parameter Mixture-of-Experts model, along with the 'prime-rl' training stack. It outperforms DeepSeek v3 on math benchmarks while democratizing the training of frontier-class models.",
    "engagement": "Medium",
    "raw_text": "This is a huge win for the open-source community. Usually, the really big, smart AI models—the ones with over 100 billion parameters—are locked behind closed doors at Google or OpenAI. But Prime Intellect just dropped INTELLECT-3. It's a massive 106-billion parameter beast, but it uses a 'Mixture of Experts' architecture, so it's actually efficient to run. The crazy part? It's beating proprietary models like DeepSeek v3 on math benchmarks. But the real story isn't just the model; it's the recipe. They open-sourced the entire training stack, called 'prime-rl'. This means smaller labs and companies can now train their own GPT-4 level models without needing a Google-sized budget. The monopoly on 'smart' AI is cracking, folks.",
    "id": "I7N8T9L0",
    "category": "AI",
    "companies": [
      "Prime Intellect"
    ],
    "people": [],
    "created_at": "2025-12-28T23:47:25+05:30"
  },
  {
    "date": "2025-12-28",
    "source_file": "Tech News Aggregation and Analysis Request (26).pdf",
    "page": 10,
    "title": "CES Leak: LG's New Monitor Uses AI to Fake 5K Resolution",
    "summary": "LG has announced the UltraGear evo (39GX950B), a 39-inch OLED gaming monitor featuring the world's first on-device AI upscaling. It uses a dedicated processor to upscale content to 5K2K resolution in real-time, offloading the burden from the GPU.",
    "engagement": "Medium",
    "raw_text": "CES 2026 leaks are starting, and LG is doing something wild with their new UltraGear monitor. We all know running games at native 5K resolution destroys your frame rate, even with a 5090. So LG put an AI processor *inside* the monitor itself. It takes whatever resolution your PC spits out and uses on-device AI to upscale it to a crisp 5K2K in real-time. This is different from DLSS because it's happening on the screen, not your graphics card. It’s a 39-inch OLED beauty, and if this tech works without adding input lag, it could change the game. We're finally seeing AI hardware that solves a real problem for gamers: getting high pixels without melting your GPU.",
    "id": "L1G2M3O4",
    "category": "Hardware",
    "companies": [
      "LG"
    ],
    "people": [],
    "created_at": "2025-12-28T23:47:25+05:30"
  },
  {
    "date": "2025-12-28",
    "source_file": "Combined",
    "page": 1,
    "title": "Google's Quantum 'Willow' Chip Solves the Impossible",
    "summary": "Google's new 'Willow' quantum processor has achieved verifiable quantum advantage using the 'Quantum Echoes' algorithm. It solved a molecular structure problem 13,000x faster than the world's fastest supercomputer, marking a repeatable breakthrough.",
    "engagement": "High",
    "raw_text": "We hear 'Quantum Breakthrough' a lot, but this one from Google is actually legit. Their new chip, 'Willow,' just ran circles around traditional supercomputers. It solved a complex molecular problem 13,000 times faster than the fastest classical computer on Earth. We're talking about a task that would take years being done in minutes. They used a new algorithm called 'Quantum Echoes' to do it. This isn't just theoretical math anymore; Google claims this opens the door to real-world applications in chemistry and materials science. We are inching closer to that moment where quantum computers stop being science fiction and start curing diseases or inventing new materials. Google calls it a 'verifiable quantum advantage,' and it's a mic-drop moment for the industry.",
    "id": "Q5U6A7N8",
    "category": "Science",
    "companies": [
      "Google"
    ],
    "people": [],
    "created_at": "2025-12-28T23:47:25+05:30"
  },
  {
    "date": "2025-12-28",
    "source_file": "Tech News Aggregation and Analysis Request (26).pdf",
    "page": 11,
    "title": "Sam Altman Admits: AI Agents Are Hacking Software",
    "summary": "OpenAI CEO Sam Altman publicly admitted that autonomous AI agents are beginning to discover critical software vulnerabilities. This coincides with reports of Chinese hackers using Anthropic's tools to automate cyberattacks.",
    "engagement": "High",
    "raw_text": "Sam Altman just said the quiet part out loud. In a recent statement, he admitted that AI agents are now capable of finding zero-day vulnerabilities in software on their own. That is terrifying. It confirms what security experts have feared: the barrier to entry for hacking is dropping to zero. You don't need to be a coding wizard anymore; you just need an AI agent. This comes right as we're seeing reports of state-sponsored hackers using tools like Claude Code to automate attacks on financial institutions. OpenAI is scrambling to hire a 'Head of Preparedness' to deal with catastrophic risks, but the cat is already out of the bag. 'Agentic AI' isn't just a helpful assistant; it's a potential cyber-weapon.",
    "id": "S9A0M1A2",
    "category": "AI",
    "companies": [
      "OpenAI",
      "Anthropic"
    ],
    "people": [
      "Sam Altman"
    ],
    "created_at": "2025-12-28T23:47:25+05:30"
  },
  {
    "date": "2025-12-28",
    "source_file": "Tech News Aggregation and Analysis Request (26).pdf",
    "page": 4,
    "title": "Bolmo: The AI That Reads Raw Bytes Instead of Text",
    "summary": "The Allen Institute for AI has introduced Bolmo, a model that processes raw UTF-8 bytes rather than tokens. This 'vocabulary-free' approach allows for better handling of low-resource languages and technical data without the biases of tokenization.",
    "engagement": "Medium",
    "raw_text": "Geek out with me for a second. Almost every AI you use—ChatGPT, Gemini—doesn't actually read words; it reads 'tokens,' which are like little chunks of text. This is efficient but causes huge problems for languages other than English or for things like coding. Enter 'Bolmo' from the Allen Institute. This new model ditches tokens entirely and reads raw bytes. It literally reads the digital DNA of the text. People thought this would be too slow, but Bolmo is matching the speed of traditional models while being way better at understanding messy data, typos, and binary code. It's a 'vocabulary-free' AI. This is a massive step forward for making AI truly universal and not just optimized for English speakers.",
    "id": "B3O4L5M6",
    "category": "AI",
    "companies": [
      "Allen Institute for AI"
    ],
    "people": [],
    "created_at": "2025-12-28T23:47:25+05:30"
  },
  {
    "date": "2025-12-28",
    "source_file": "Combined",
    "page": 2,
    "title": "Google Launches ₹399 'AI Plus' Plan for India",
    "summary": "Google has rolled out a competitively priced 'AI Plus' subscription in India at ₹399/month. The plan includes Gemini 3 Pro access, 200GB of cloud storage, and new creative tools, undercutting global competitors.",
    "engagement": "High",
    "raw_text": "Google is going hard for the Indian market. They just dropped a new 'AI Plus' subscription that costs ₹399 a month—and it's half off for the first six months. For that price, you're not just getting their best AI model, Gemini 3 Pro; you're also getting 2 TB of storage and access to new video generation tools. This is a direct shot at OpenAI, who launched a cheaper tier earlier, but Google is bundling it with the stuff you actually use, like Drive and Photos. If you're in India, the AI war is officially driving prices down, which is a win for consumers. It's affordable, it's powerful, and it's putting pressure on everyone else to lower their rates.",
    "id": "G7I8N9D0",
    "category": "Business",
    "companies": [
      "Google"
    ],
    "people": [],
    "created_at": "2025-12-28T23:47:25+05:30"
  },
  {
    "date": "2025-12-28",
    "source_file": "Tech News Aggregation and Analysis Request (26).pdf",
    "page": 6,
    "title": "Meta's 'SAM Audio' Lets You Edit Sound with Words",
    "summary": "Meta has released SAM Audio, an open-source model that isolates specific sounds in a recording using text prompts. It extends the 'Segment Anything' revolution to audio, allowing creators to remix and edit soundscapes effortlessly.",
    "engagement": "Medium",
    "raw_text": "Meta is on a roll with open source. You remember SAM, the model that could cut out any object from a photo? Well, meet SAM Audio. It does the same thing but for sound. You can feed it a noisy recording and just type 'isolate the drums' or 'remove the dog barking,' and it does it instantly. It uses a diffusion architecture to separate the audio layers. For YouTubers, podcasters, and music producers, this is a magic wand. No more fiddling with EQ for hours. There is a bit of controversy—some experts say it might 'hallucinate' sounds to fill in the gaps—but for creative work, this tool is going to save us all a ton of time.",
    "id": "M1E2T3A4",
    "category": "AI",
    "companies": [
      "Meta"
    ],
    "people": [],
    "created_at": "2025-12-28T23:47:25+05:30"
  },
  {
    "date": "2025-12-28",
    "source_file": "Tech News Aggregation and Analysis Request (26).pdf",
    "page": 11,
    "title": "Massive 'Kimwolf' Botnet Infects 1.8 Million Devices",
    "summary": "A new botnet dubbed 'Kimwolf' has compromised 1.8 million IoT devices, creating a massive network capable of launching crippling DDoS attacks. The scale of the infection points to widespread supply-chain vulnerabilities in consumer electronics.",
    "engagement": "High",
    "raw_text": "Time to check your smart home gadgets. A massive new botnet called 'Kimwolf' has just been discovered, and it has already infected 1.8 million devices. We're talking about smart cameras, routers, maybe even that smart fridge you never update. This isn't just a nuisance; a botnet this size is basically a cyber-nuke. It can launch DDoS attacks big enough to take down major internet infrastructure or cloud providers. It highlights a huge problem we keep ignoring: cheap smart devices with terrible security are a ticking time bomb. If you haven't changed the default password on your router or updated your firmware recently, do it now. You do not want to be part of the Kimwolf army.",
    "id": "K5I6M7W8",
    "category": "Security",
    "companies": [],
    "people": [],
    "created_at": "2025-12-28T23:47:25+05:30"
  }
]